#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.azure_sql.azurerm_mssql_database.main has been deleted
  - resource "azurerm_mssql_database" "main" {
      - id                                                         = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk/databases/sqldb-020rojwk" -> null
        name                                                       = "sqldb-020rojwk"
        tags                                                       = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.azure_sql.azurerm_mssql_server.main has been deleted
  - resource "azurerm_mssql_server" "main" {
      - id                                       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk" -> null
      - name                                     = "mssqlserver020rojwk" -> null
        tags                                     = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (13 unchanged attributes hidden)
    }

  # module.azure_sql.azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
        id       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure"
      - location = "southindia" -> null
      - name     = "rg-infrastructure" -> null
        tags     = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure_sql.azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = (known after apply)
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-020rojwk"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "S0"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)
    }

  # module.azure_sql.azurerm_mssql_firewall_rule.allow_specific_ip will be created
  + resource "azurerm_mssql_firewall_rule" "allow_specific_ip" {
      + end_ip_address   = "129.41.46.1"
      + id               = (known after apply)
      + name             = "allow-specific-ip"
      + server_id        = (known after apply)
      + start_ip_address = "129.41.46.1"
    }

  # module.azure_sql.azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                      = "sqladmin"
      + administrator_login_password             = (sensitive value)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "westeurope"
      + minimum_tls_version                      = "1.2"
      + name                                     = "mssqlserver020rojwk"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "rg-sql-production"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + version                                  = "12.0"
    }

  # module.azure_sql.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-sql-production"
      + tags     = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ sql_database_id = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk/databases/sqldb-020rojwk" -> (known after apply)
  - sql_server_id   = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk" -> null
  + sql_server_name = "mssqlserver020rojwk"

```

</details>

*Plan generated at: 2026-02-25T12:22:09.644Z*